// Задачка под нахождение квадрата/степени числа

Console.Write("Write your number = ");
Console.Write($"Kvadrat vvedennogo chisla = {Math.Pow(int.Parse(Console.ReadLine()), 2)}\n"); 

/* $ ищет фигурные скобки чтобы найти переменную или решить какой то пример.
{math.pow} - возведи в степень следующее скобки открываются,
int.Parse - переведи в число (инт=число, parse=переведи)следующее скобки открываются, 
Console.Readline - то что было прописано ранее в console.write 
закрываем все возможные скобки))
\n - переносим на новую строку */

